{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "16"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Shape", "op": "Shape", "input": ["inputs"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Shape", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack_1", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/ReadVariableOp", "inputs"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Shape", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack_1", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Shape", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack_1", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose", "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 64, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_75_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_76_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder_1/conv2d_transpose_77_1/Reshape", "shape": [1, 1, 1, 1], "dtype": "float32"}]}]}